import React from "react";
import {  Container } from "react-bootstrap";
import "../../styles/Why.css"
const Why = () => {
  return (
    <div className="why">
      <Container>
        <h1 class="why_section_h">Почему нужно арендовать у нас?</h1>
        <div class="cards">
          <div class="item">
            <div class="svg_class">
              <svg
                width="92"
                height="92"
                viewBox="0 0 92 92"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="46" cy="46" r="46" fill="#F9FAFC" />
                <path
                  opacity="0.3"
                  d="M68.1154 45.9997C68.1154 33.7857 58.214 23.8843 46 23.8843C33.786 23.8843 23.8846 33.7857 23.8846 45.9997C23.8846 58.2137 33.786 68.115 46 68.115C58.214 68.115 68.1154 58.2137 68.1154 45.9997Z"
                  fill="#3C5CCF"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M33.1022 51.6499C32.4247 50.6337 32.6993 49.2606 33.7156 48.5831C34.7318 47.9056 36.1049 48.1802 36.7824 49.1965C39.3413 53.0347 42.3606 54.8463 46 54.8463C49.6395 54.8463 52.6588 53.0347 55.2176 49.1965C55.8951 48.1802 57.2682 47.9056 58.2844 48.5831C59.3007 49.2606 59.5753 50.6337 58.8978 51.6499C55.5592 56.6578 51.2067 59.2694 46 59.2694C40.7933 59.2694 36.4408 56.6578 33.1022 51.6499Z"
                  fill="#3C5CCF"
                />
              </svg>
            </div>
            <div class="service_title">
              Удобный и простой сервис по аренде новинок техники и гаджетов
            </div>
          </div>
          <div class="item">
            <div class="svg_class">
              <svg
                width="92"
                height="92"
                viewBox="0 0 92 92"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="46" cy="46" r="46" fill="#F9FAFC" />
                <path
                  opacity="0.3"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M46.5 68.0835C34.2807 68.0835 24.375 58.1778 24.375 45.9585C24.375 33.7392 34.2807 23.8335 46.5 23.8335C58.7193 23.8335 68.625 33.7392 68.625 45.9585C68.625 58.1778 58.7193 68.0835 46.5 68.0835Z"
                  fill="#3C5CCF"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M46.4091 32.4375H46.6168C47.2483 32.4375 47.777 32.916 47.8398 33.5444L48.9583 44.7292L56.9432 49.2919C57.3261 49.5108 57.5625 49.9181 57.5625 50.3591V50.875C57.5625 51.3935 57.1422 51.8138 56.6237 51.8138C56.5402 51.8138 56.4571 51.8027 56.3766 51.7808L45.0217 48.684C44.4529 48.5288 44.0743 47.9917 44.1196 47.4038L45.1835 33.5724C45.2328 32.932 45.7668 32.4375 46.4091 32.4375Z"
                  fill="#3C5CCF"
                />
              </svg>
            </div>
            <div class="service_title">
              Неограниченный срок аренды (от одного дня)
            </div>
          </div>
          <div class="item">
            <div class="svg_class">
              <svg
                width="92"
                height="92"
                viewBox="0 0 92 92"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="46" cy="46" r="46" fill="#F9FAFC" />
                <path
                  opacity="0.3"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M28.6667 28.6667L45.2014 25.5664C45.7292 25.4674 46.2708 25.4674 46.7986 25.5664L63.3334 28.6667V48.7799C63.3334 55.1377 60.0581 61.047 54.6667 64.4167L47.1483 69.1156C46.4458 69.5547 45.5543 69.5547 44.8517 69.1156L37.3334 64.4167C31.9419 61.047 28.6667 55.1377 28.6667 48.7799V28.6667Z"
                  fill="#3C5CCF"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M44.2125 51.9583C43.6934 51.9583 43.1743 51.7507 42.759 51.3354L38.6063 47.1826C37.7757 46.3521 37.7757 45.1062 38.6063 44.2757C39.4368 43.4451 40.7865 43.4451 41.5132 44.2757L44.2125 46.975L51.0646 40.1229C51.8951 39.2924 53.141 39.2924 53.9715 40.1229C54.8021 40.9535 54.8021 42.1993 53.9715 43.0299L45.666 51.3354C45.2507 51.7507 44.7316 51.9583 44.2125 51.9583Z"
                  fill="#3C5CCF"
                />
              </svg>
            </div>
            <div class="service_title">
              Гарантированный сервис и отсутствие риска
            </div>
          </div>
          <div class="item">
            <div class="svg_class">
              <svg
                width="92"
                height="92"
                viewBox="0 0 92 92"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="46" cy="46" r="46" fill="#F9FAFC" />
                <path
                  opacity="0.3"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M65.6143 33.7171C66.457 34.0916 67 34.9272 67 35.8494V56.2934C67 57.1408 66.5406 57.9215 65.7998 58.3331L47.1332 68.7034C46.4284 69.095 45.5716 69.095 44.8668 68.7034L26.2002 58.3331C25.4594 57.9215 25 57.1408 25 56.2934V35.8494C25 34.9272 25.543 34.0916 26.3857 33.7171L45.0523 25.4208C45.6557 25.1527 46.3443 25.1527 46.9477 25.4208L65.6143 33.7171Z"
                  fill="#3C5CCF"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M52.9233 27.8574L35.7333 37.4074V48.1137L40.3999 50.447V40.1533L58.2618 30.2301L52.9233 27.8574Z"
                  fill="#3C5CCF"
                />
              </svg>
            </div>
            <div class="service_title">
              Доставка в удобное вам время и место
            </div>
          </div>
        </div>
      </Container>
    </div>
  );
};

export default Why;
